package dev.jacbes.utils

const val DIRECTORY = "temp"
const val RANDOM_NAME_LENGTH = 10
val CYRILLIC_CHAR_LIST = listOf(
    'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й',
    'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
    'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я',
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й',
    'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф',
    'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'
)
val ENG_CYRILLIC_CHAR_LIST = listOf(
    "a", "b", "v", "g", "d", "e", "e", "j", "z", "i", "i",
    "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f",
    "h", "c", "ch", "sh", "sh", "", "i", "'", "e", "u", "ya",
    "A", "B", "V", "G", "D", "E", "E", "J", "Z", "I", "I",
    "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F",
    "H", "C", "CH", "SH", "SH", "", "I", "'", "E", "U", "YA"
)